src/DataProcessors/ИС_MP_СозданиеНоменклатурыПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_MP_СозданиеНоменклатурыПоТоварам</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляСозданияНоменклатурыOzon</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Создавать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИС_Ozon_Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>product_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>sku</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>offer_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаБезУчетаСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаАкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПремиум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендованнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенНаСкладе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляПокупки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>sku_fbs</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_kgt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>updated_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>sku_fbo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description_category_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Категории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>primary_image</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>has_discounted_item</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_discounted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>min_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dictionary_value_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idЗначенияАтрибута</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изображения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_MP_СозданиеНоменклатурыПоТоварам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ПрофильПриИзмененииНаСервере();
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура ВыбратьВсе(Команда)

	Для Каждого стр Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		стр.Создавать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура ИсключитьВсе(Команда)

	Для Каждого стр Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		стр.Создавать = Ложь;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	ВыбранныеТовары = Объект.ДанныеДляСозданияНоменклатурыOzon.НайтиСтроки(Новый Структура("Создавать", Истина));
	Если ВыбранныеТовары.Количество() = 0 Или Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Для перехода к созданию номенклатуры, необходимо выбрать один или несколько товаров и выбрать вид номенклатуры");
		Возврат;
	КонецЕсли;
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаСервере
Процедура ПрофильПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.Ссылка КАК НоменклатураOzon,
		|	ИС_Ozon_Номенклатура.Наименование КАК Наименование,
		|	ИС_Ozon_Номенклатура.offer_id КАК Артикул,
		|	ИС_Ozon_Номенклатура.Код КАК product_id,
		|	ИС_Ozon_Штрихкоды.Наименование КАК Штрихкод
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|		ПО ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_Штрихкоды.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon = ИС_Ozon_Номенклатура.Ссылка
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Профиль = &Профиль
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Объект.ДанныеДляСозданияНоменклатурыOzon.Загрузить(ВыборкаДетальныеЗаписи);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628


//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
 			
	Если Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() Тогда
		//Элементы.СоздаватьХарактеристики.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
	ВыбранныеТовары = Объект.ДанныеДляСозданияНоменклатурыOzon.НайтиСтроки(Новый Структура("Создавать", Истина));
	ТаблицаТовары 	= Объект.ДанныеДляСозданияНоменклатурыOzon.Выгрузить(ВыбранныеТовары);
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	СтруктураСвойств.Вставить("ГруппаНоменклатуры", ГруппаНоменклатуры);
	СтруктураСвойств.Вставить("СтавкаНДС", СтавкаНДС);
	
	Таблица = ИС_Ozon_Сервер.СоздатьНоменклатуру(ТаблицаТовары, СтруктураСвойств); 
	
	Для Каждого Строка Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("НоменклатураOzon", Строка.НоменклатураOzon)); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
				Строка.Номенклатура = НайденныеСтроки[0].Номенклатура;
		КонецЕсли; 
			
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

#КонецОбласти
